var subway = [
  {
    "timeTableDesc": "",
    "stations": [
      {
        "length": 2606,
        "lastTrain": [
          {
            "direction": "往四惠东方向",
            "last": "22:55",
            "first": "5:10"
          },
          {
            "direction": "往苹果园方向",
            "last": "——",
            "first": "——"
          }
        ],
        "id": 1001,
        "name": "苹果园"
      },
      {
        "length": 1921,
        "lastTrain": [
          {
            "direction": "往四惠东方向",
            "last": "22:59",
            "first": "4:58"
          },
          {
            "direction": "往苹果园方向",
            "last": "0:06",
            "first": "5:36"
          }
        ],
        "id": 1011,
        "name": "古城"
      }
    ],
    "name": "1号线",
    "id": 1
  },
  {
    "timeTableDesc": "",
    "stations": [
      {
        "length": 909,
        "lastTrain": [
          {
            "direction": "外环全程（西直门->车公庄->复兴门->东直门->积水潭->西直门）方向",
            "last": "22:15",
            "first": "5:10"
          },
          {
            "direction": "外环积水潭半程（西直门->车公庄->复兴门->东直门->积水潭）方向",
            "last": "23:00",
            "first": "5:10"
          },
          {
            "direction": "内环全程（积水潭->鼓楼大街->东直门->复兴门->西直门->积水潭）方向",
            "last": "22:42",
            "first": "5:34"
          },
          {
            "direction": "内环西直门半程（积水潭->鼓楼大街->东直门->复兴门->西直门）方向",
            "last": "——",
            "first": "5:34"
          }
        ],
        "id": 2001,
        "name": "西直门"
      },
      {
        "length": 960,
        "lastTrain": [
          {
            "direction": "外环全程（西直门->车公庄->复兴门->东直门->积水潭->西直门）方向",
            "last": "22:17",
            "first": "5:12"
          },
          {
            "direction": "外环积水潭半程（西直门->车公庄->复兴门->东直门->积水潭）方向",
            "last": "23:02",
            "first": "5:12"
          },
          {
            "direction": "内环全程（积水潭->鼓楼大街->东直门->复兴门->西直门->积水潭）方向",
            "last": "22:35",
            "first": "5:30"
          },
          {
            "direction": "内环西直门半程（积水潭->鼓楼大街->东直门->复兴门->西直门）方向",
            "last": "23:24",
            "first": "5:30"
          }
        ],
        "id": 2011,
        "name": "车公庄"
      },
      {
        "length": 1832,
        "lastTrain": [
          {
            "direction": "外环全程（西直门->车公庄->复兴门->东直门->积水潭->西直门）方向",
            "last": "22:19",
            "first": "5:14"
          },
          {
            "direction": "外环积水潭半程（西直门->车公庄->复兴门->东直门->积水潭）方向",
            "last": "23:04",
            "first": "5:14"
          },
          {
            "direction": "内环全程（积水潭->鼓楼大街->东直门->复兴门->西直门->积水潭）方向",
            "last": "22:33",
            "first": "5:28"
          },
          {
            "direction": "内环西直门半程（积水潭->鼓楼大街->东直门->复兴门->西直门）方向",
            "last": "23:22",
            "first": "5:28"
          }
        ],
        "id": 2021,
        "name": "阜成门"
      }
    ],
    "name": "2号线",
    "id": 2
  }
];

module.exports = subway;